newapp/app/views/game/index.html.erb

      <% @games.each do |game|%>
      <% home_team = Team.find(game.home_team_id) %>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."home_team_id" = ? LIMIT 1  [[nil, 63]]