newapp/app/controllers/card_controller.rb

UPDATE "users" SET "customer_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["customer_id", "cus_8rxeyRNtMxnkzt"], ["updated_at", "2016-07-23 00:11:15.383117"], ["id", 2]]
---
  def create
    if request.xhr?
      p params
    token = params[:token]
    p token
    p "****"*50
    customer = Stripe::Customer.create(
      source: token,
      description: 'first example user'
      )

    # @user = User.new(email: 'test@test.com', customer_id: customer.id)
    # @user.password = '1234'
    # @user.save

     @user = current_user
     @user.customer_id = customer.id
     @user.save