newapp/app/controllers/game_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @games = Game.all