newapp/app/controllers/session_controller.rb

  def create
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "tom"]]