newapp/app/controllers/user_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "tom1"], ["password_digest", "$2a$10$hIga1MEy2asoKt26HQ9d.ubT5swQYF7wvOMrsLy8nDnj4JtZfuJIS"], ["created_at", "2016-07-23 00:07:14.007121"], ["updated_at", "2016-07-23 00:07:14.007121"]]
---
  def create
    p "*****"*50
    user = User.new(user_params)

    if user.save